In [2]:
import numpy as np
import pandas as pd

In [5]:
d=pd.DataFrame({0:['A1','B2','C3','D4'],1:[1,2,'Z','X']})
d

    0  1
0  A1  1
1  B2  2
2  C3  Z
3  D4  X

In [9]:
d[2]=pd.to_numeric(d[1],errors='coerce',downcast='integer')
d[2]
# If ‘coerce’, then invalid parsing will be set as NaN.

0    1.0
1    2.0
2    NaN
3    NaN
Name: 2, dtype: float64

In [15]:
d[3]=np.where(d[2].isnull(),d[1],np.nan)
d[3]

0    NaN
1    NaN
2      Z
3      X
Name: 3, dtype: object

In [16]:
d

    0  1    2    3
0  A1  1  1.0  NaN
1  B2  2  2.0  NaN
2  C3  Z  NaN    Z
3  D4  X  NaN    X

In [22]:
d[4]=d[0].str.extract(r'([0-9]+)')
d[4]

0    1
1    2
2    3
3    4
Name: 4, dtype: object

In [24]:
d[5]=d[0].str.extract(r'([a-zA-Z]+)')
d[5]

0    A
1    B
2    C
3    D
Name: 5, dtype: object

In [25]:
d

    0  1    2    3  4  5
0  A1  1  1.0  NaN  1  A
1  B2  2  2.0  NaN  2  B
2  C3  Z  NaN    Z  3  C
3  D4  X  NaN    X  4  D